{
  "imbalance_analysis": {
    "Wood(Wood)": {
      "excess": {
        "title": "빽빽한 숲처럼, 자아와 욕망이 과하게 엉켜 있네.",
        "psychology": "지나친 이상주의, 성급함, 과격한 추진력. 자기 주장이 너무 강하여 타인의 의견을 무시하기 쉽네.",
        "physical": "간(肝), 담(膽) 에너지 과다. 신경질, 편두통, 혈압 상승, 근육 경련, 담석.",
        "shamanic_voice": "성장 욕구는 좋으나, 너무 앞으로만 내달리면 뿌리가 썩는다네. 스스로를 돌아보는 여유를 가져야 해."
      },
      "isolation": {
        "title": "뿌리 없는 나무처럼, 목표와 추진력이 약하네.",
        "psychology": "우유부단함, 소심함, 계획은 많으나 실천이 부족함. 미래에 대한 불안감이 크네.",
        "physical": "간(肝), 담(膽) 에너지 부족. 만성피로, 무기력증, 시력 저하, 관절의 유연성 부족.",
        "shamanic_voice": "세상을 향해 발을 뻗을 용기가 부족하네. 목표를 종이에 적어 붙이고 작은 것부터 성취해야 해."
      }
    },
    "Fire(Fire)": {
      "excess": {
        "title": "사막의 태양처럼, 모든 것을 태워버릴 듯 뜨거운 열정.",
        "psychology": "조급함, 과도한 흥분, 감정 기복이 심함. 겉으로는 밝으나 속으로 고독을 삭히기 쉽네.",
        "physical": "심장(心), 소장(小腸) 에너지 과다. 가슴 두근거림, 불면증, 고혈압, 안구 건조, 잦은 염증.",
        "shamanic_voice": "타오르는 불길을 잠시 꺼야 할 때네. 지나친 열정은 주위 사람에게 화상(스트레스)을 입히네."
      },
      "isolation": {
        "title": "꺼진 촛불처럼, 냉정하고 의욕이 없네.",
        "psychology": "냉소적, 우울함, 사회성이 부족하고 대인관계에 어려움을 겪음. 삶의 즐거움을 찾기 어려워함.",
        "physical": "심장(心), 소장(小腸) 에너지 부족. 저혈압, 무기력, 소화 불량, 심신 불안정.",
        "shamanic_voice": "자네의 심장에 불씨를 지펴야 해. 사람들과 교류하며 밝은 에너지를 받아야 기운이 살아난다네."
      }
    },
    "Earth(Earth)": {
      "excess": {
        "title": "높은 산맥처럼, 자기 고집이 세고 변화를 거부하네.",
        "psychology": "고집이 세고 융통성이 부족함. 지나친 소유욕, 의심과 걱정이 많아 스스로를 옭아매네.",
        "physical": "비장(脾), 위(胃) 에너지 과다. 소화 불량, 위염, 비만, 당뇨, 몸이 무겁고 잘 부음.",
        "shamanic_voice": "세상에 자네 혼자만 사는 것이 아니네. 내려놓음과 타협의 미덕을 배워야 평온해진다네."
      },
      "isolation": {
        "title": "떠다니는 흙먼지처럼, 정착하지 못하고 불안하네.",
        "psychology": "현실 감각 부족, 의존적, 변덕이 심함. 책임감이 부족하여 마무리가 약하네.",
        "physical": "비장(脾), 위(胃) 에너지 부족. 식욕 부진, 저체중, 면역력 저하, 만성 설사.",
        "shamanic_voice": "자네의 중심(중정)이 잡혀 있지 않네. 신뢰할 만한 멘토를 찾아 중심을 잡고, 꾸준함을 익혀야 해."
      }
    },
    "Metal(Metal)": {
      "excess": {
        "title": "서로 부딪혀 깨지는 칼날",
        "psychology": "지나치게 냉정하고 비판적임. 남에게 상처 주는 말을 서슴지 않음. 결벽증적 성향.",
        "physical": "폐(肺), 대장(大腸) 에너지 과다. 호흡기 질환, 피부 건조증, 잦은 기침, 치질, 변비.",
        "shamanic_voice": "입에 칼을 물었나? 말 한마디 한마디가 너무 날카로워. 그러다 주변 사람 다 떠나네. 그 깐깐한 성격 좀 죽이게."
      },
      "isolation": {
        "title": "녹슨 무쇠처럼, 의리 없고 소심하네.",
        "psychology": "매사 비관적, 우울감, 고독을 즐기나 외로움이 큼. 자신감이 없어 남에게 쉽게 휘둘리네.",
        "physical": "폐(肺), 대장(大腸) 에너지 부족. 면역력 약화, 호흡 곤란, 알레르기, 우울증.",
        "shamanic_voice": "자네의 칼을 갈고 세상에 나서야 해. 자신감과 용기를 가지고 사람들과 당당히 맞서게."
      }
    },
    "Water(Water)": {
      "excess": {
        "title": "범람하는 강물처럼, 지혜가 지나쳐 음침해지네.",
        "psychology": "음침함, 비밀스러움, 사고가 비관적이고 부정적임. 현실에 안주하며 게으름을 피우기 쉽네.",
        "physical": "신장(腎), 방광(膀胱) 에너지 과다. 부종(붓기), 수족냉증, 신장염, 빈뇨, 생식기 질환.",
        "shamanic_voice": "생각이 너무 많으면 우물에 갇힌 개구리 신세가 된다네. 머리가 아닌 몸을 움직여야 하네."
      },
      "isolation": {
        "title": "메마른 대지처럼, 지혜와 인내심이 부족하네.",
        "psychology": "지나치게 솔직하여 실수함. 감정 조절이 어렵고 인내심이 약함. 성적인 무관심.",
        "physical": "신장(腎), 방광(膀胱) 에너지 부족. 만성 피로, 허리/관절 통증, 이명(귀울림), 탈모, 정력 감퇴.",
        "shamanic_voice": "깊은 바다처럼 사색하고 인내해야 하네. 꾸준히 지혜를 쌓아 자네의 그릇을 채워야 해."
      }
    }
  },
  "ten_gods_interactions": {
    "괴강살_발동(Gwegang_Star)": {
      "effect_ko": "일지에 괴강(경진, 임진, 무술, 경술 등)을 깔았으니, 강력한 리더십과 통제력을 가졌으나 고독과 살기(殺氣)를 동반하네. 난세에 영웅이 되거나, 법적 갈등(관재 구설)에 휘말릴 리스크가 공존한다네.",
      "remedy_advice": "자신의 살기(殺氣)를 활인업(의료, 법조, 군경)이나 종교, 봉사 활동으로 풀지 않으면 반드시 흉함을 겪네. 독단적인 결정을 피하고 주변과 협의하는 겸손함이 필요하네.",
      "shamanic_voice": "혼자 우뚝 서려다 모든 걸 잃을 수 있어. 그 고집을 꺾고 세상 사람을 이롭게 하는 데 쓰게!"
    },
    "재다비겁_패턴(Wealth_vs_Self_Pattern)": {
      "effect_ko": "재물이 많아 친구/형제(비겁)가 재물을 탐하여 다투는 형국이네. 동업이나 금전 거래는 절대 금물이며, 사기나 배신을 당할 리스크가 크니 재물은 홀로 관리해야 하네.",
      "remedy_advice": "비밀금고를 만들어 재산을 분산하고, 재물을 사회적 기부나 공익적인 일에 써서 흉함을 피해야 하네. 동료보다는 직장 상사/연장자와의 관계가 길하네.",
      "shamanic_voice": "재물은 홀로 지키는 법. 남에게 돈 자랑하지 말게나."
    },
    "식신제살_패턴(Output_Controlling_Official)": {
      "effect_ko": "강한 압박(편관)을 자신의 재능(식신)으로 능히 다스리는 최고의 길격 중 하나라네. 위기 상황에서 능력을 발휘하고, 남들이 피하는 고난도 분야에서 성공하네.",
      "remedy_advice": "명예나 관직을 쫓기보다, 자신의 전문 기술이나 재능을 갈고 닦아 사회에 기여해야 하네. 기술력으로 위기를 극복하게.",
      "shamanic_voice": "자네의 솜씨(식신)는 칼(편관)도 두려워하지 않네. 손해를 보더라도 기술 투자에 집중하게."
    },
    "재다신약_패턴(Wealth_Dominance)": {
      "effect_ko": "재성(재물/이성)은 강한데 일간(나의 힘)이 약한 형국이라네. 돈과 사람에 휘둘려 끌려다니기 쉬우며, 벌어도 내 것이 아닌 것처럼 재물이 새나간다네.",
      "remedy_advice": "재물을 직접 관리하지 말고 문서화된 안전 자산(부동산, 채권)으로 바꾸게. 건강(인성/비겁)과 정신 수양에 힘써 일간의 근본을 강화해야 하네.",
      "shamanic_voice": "욕심(재성)은 큰데 그릇(일간)이 작으니, 그릇부터 키워야 해. 자네 마음대로 되는 것이 하나도 없지? 그게 다 약하기 때문이야."
    }
  },
  "relationship_dynamics": {
    "Mutual_Generation": {
      "생해주는_관계": {
        "ko_desc": "자신을 희생하여 상대를 돕는 부모와 같은 역할. 주는 기쁨은 크나, 지나치면 내가 고갈될 수 있으니 주의해야 하네.",
        "advice": "베푸는 것을 당연하게 여기지 않도록, 상대에게서 정신적/감정적 피드백을 요구하게."
      },
      "생받는_관계": {
        "ko_desc": "상대에게 무한한 지원과 사랑을 받는 자식과 같은 역할. 편안함 속에서 나태해지거나, 상대를 하대하지 않도록 주의해야 하네.",
        "advice": "상대의 희생에 진심으로 감사하고, 경제적이든 정신적이든 실질적인 보상을 제공하게."
      }
    },
    "Mutual_Controlling": {
      "극하는_관계": {
        "ko_desc": "상대의 명예, 사회적 영역, 또는 재물에 대해 통제하고 간섭하는 역할. 주도권은 쥐나, 상대에게는 큰 스트레스와 고통을 주네.",
        "advice": "상대를 강하게 극하는 것은 결국 내 명예(관성)에 손상을 준다네. 통제보다는 격려로 대해야 하네."
      },
      "극받는_관계": {
        "ko_desc": "상대의 통제와 간섭으로 인해 심리적 압박감과 답답함을 느끼는 역할. 때로는 이 긴장감이 나를 발전시키기도 하나, 장기적으로는 자신감이 하락하네.",
        "advice": "상대의 간섭을 무조건 피하기보다, 이를 발전의 자양분으로 삼아 자신의 틀을 단단히 하는 지혜가 필요하네."
      }
    }
  }
}