{
  "year_pillar": {
    "desc": "초년운 (0~19세). 조상과 부모의 그늘, 그리고 유년 시절의 환경을 의미하네.",
    "비견": {
      "ko_desc": "일찍부터 자립심이 강해 부모의 도움보다 내 힘으로 크려 했겠군. 형제나 친구를 좋아해 밖으로 나돌기 쉬웠던 어린 시절이라네.",
      "advice": "일찍 철이 든 것은 좋으나, 너무 고집을 피우면 부모와 마찰이 생길 수 있었네. 친구 따라 강남 가지 말고 주관을 지켜야 했지."
    },
    "겁재": {
      "ko_desc": "어린 시절부터 경쟁심이 남달랐네. 형제간에 다툼이 있었거나, 내 것을 뺏기지 않으려는 투쟁심이 강하게 자리 잡았을 걸세.",
      "advice": "승부욕은 좋으나 욕심이 과하면 탈이 나네. 어릴 때부터 나눔의 기쁨을 알았다면 더 큰 그릇이 되었을 걸세."
    },
    "식신": {
      "ko_desc": "의식주가 풍족한 유년기를 보냈을 가능성이 크네. 잘 먹고 잘 놀며, 표현력이 좋아 주위의 귀여움을 독차지했을 아이였구먼.",
      "advice": "평탄한 어린 시절이 자산이 되나, 너무 편안함에 안주하면 끈기가 부족해질 수 있으니 주의해야 했네."
    },
    "상관": {
      "ko_desc": "총명하지만 반항심이 가득한 어린 시절이었네. 부모나 선생님의 말에 '왜요?'라고 따져 묻는, 남다른 천재성이 있었지.",
      "advice": "재주는 비상하나 튀는 행동으로 어른들의 눈밖에 날 수 있었네. 그 비판적인 사고를 학문이나 예술로 풀었어야 하네."
    },
    "편재": {
      "ko_desc": "스케일이 큰 아버지를 두었거나, 일찍부터 돈이나 장난감에 대한 소유욕이 강했네. 공부보다는 노는 게 더 좋았던 시절이지.",
      "advice": "재물복은 타고났으나 학업에는 소홀하기 쉬웠네. 어릴 때부터 경제 관념을 심어주는 것이 중요했네."
    },
    "정재": {
      "ko_desc": "어릴 때부터 꼼꼼하고 착실한 모범생이었네. 용돈을 주면 허투루 쓰지 않고 모으는, 알뜰살뜰한 아이였지.",
      "advice": "너무 일찍 어른스러워져서 계산적인 면이 있었을 수 있네. 가끔은 아이답게 떼도 쓰고 놀아도 괜찮았다네."
    },
    "편관": {
      "ko_desc": "엄한 가정환경 속에서 눈치를 보며 자랐거나, 몸이 약해 병치레를 했을 수 있네. 그래서 또래보다 일찍 철이 들 수밖에 없었지.",
      "advice": "힘든 환경이 자네를 강하게 만들었네. 어릴 때의 억눌림을 트라우마로 남기지 말고, 나를 단련한 훈장으로 여기게."
    },
    "정관": {
      "ko_desc": "반듯하고 예의 바른 아이로, 집안의 자랑이었겠군. 반장이나 임원을 도맡아 하며 명예욕이 있었던 유년기라네.",
      "advice": "모범생의 틀에 갇혀 자신의 진짜 꿈을 억눌렀을 수 있네. 남의 시선보다 자네의 행복이 더 중요하다는 걸 잊지 말게."
    },
    "편인": {
      "ko_desc": "눈치가 빠르고 생각이 깊은 아이였네. 가끔 엉뚱한 상상을 하거나, 부모의 사랑을 갈구하며 외로움을 탔을 수도 있네.",
      "advice": "남다른 예민함은 예술적 재능이라네. 외로움을 즐기되, 너무 폐쇄적으로 굴면 고립될 수 있으니 친구들과 어울리게."
    },
    "정인": {
      "ko_desc": "어머니의 사랑을 듬뿍 받고 자란 귀한 자식이라네. 공부도 잘하고 착해서 어디 가서도 미움받지 않는 아이였지.",
      "advice": "받는 것에만 익숙해지면 의존적인 성향이 될 수 있네. 사랑받은 만큼 베푸는 법도 배웠어야 진정한 어른이 되네."
    }
  },
  "month_pillar": {
    "desc": "청년운 (20~39세). 사회 진출과 직업, 그리고 부모 형제와의 관계를 의미하네.",
    "비견": {
      "ko_desc": "조직 생활보다는 내 일을 하고 싶어 하는 독립군 기질이 강하네. 동료와 경쟁하며 성장하지만, 독단적인 행동은 피해야 하네.",
      "advice": "자존심만 내세우다가는 사회에서 고립되네. 협력하는 법을 배우면 든든한 동료를 얻을 것이야."
    },
    "겁재": {
      "ko_desc": "치열한 경쟁 사회에 던져진 형국이라네. 내 밥그릇을 노리는 자들이 많으니, 뺏고 뺏기는 투쟁 속에서 생존 본능을 키워야 하네.",
      "advice": "적을 동지로 만드는 지혜가 필요하네. 혼자 다 가지려 하지 말고, 이익을 나누면 오히려 내 몫이 커진다네."
    },
    "식신": {
      "ko_desc": "한 가지 재능으로 평생 먹고살 전문성을 갖추게 되네. 좋아하는 일을 업으로 삼으니 일하는 즐거움을 아는 청년기라네.",
      "advice": "꾸준함이 무기네. 이것저것 손대기보다 한 우물을 깊게 파면, 그 분야의 장인이 될 수 있네."
    },
    "상관": {
      "ko_desc": "기존 질서에 도전하고 개혁하려는 반골 기질이 있네. 말과 재주가 뛰어나니 영업, 언변, 기술직에서 두각을 나타내네.",
      "advice": "상사와의 마찰을 조심하게. 자네의 옳은 말이 윗사람에게는 하극상으로 보일 수 있네. 겸손을 갑옷으로 입게."
    },
    "편재": {
      "ko_desc": "월급봉투보다는 사업 대박을 꿈꾸는 야망가라네. 활동 무대가 넓고 역마가 있어 해외나 지방을 오가며 분주히 살겠군.",
      "advice": "돈 냄새는 잘 맡으나 관리가 안 되면 밑 빠진 독이네. 버는 것보다 지키는 시스템을 먼저 만들어야 하네."
    },
    "정재": {
      "ko_desc": "성실하게 월급 모아 내 집 마련하는 것이 목표인 현실파라네. 모험보다는 안정을 택하니 직장 생활에 최적화된 인재지.",
      "advice": "너무 아끼다 똥 된다는 말이 있네. 가끔은 나를 위한 투자도 하고, 시야를 넓혀야 더 큰 기회가 오네."
    },
    "편관": {
      "ko_desc": "총대 메고 험한 일을 도맡아 하는 해결사라네. 책임감이 강해 조직에서 인정받지만, 과로와 스트레스로 몸이 상할 수 있네.",
      "advice": "권력욕이 자네를 태울 수 있네. 완장을 차는 것은 좋으나, 그 무게를 견디려면 체력 관리부터 하게."
    },
    "정관": {
      "ko_desc": "반듯한 직장, 명함 내밀기 좋은 곳에 인연이 있네. 원칙을 중시하고 보수적이라 승진 가도를 달리는 모범 직장인이네.",
      "advice": "틀을 깨는 것을 두려워 말게. 너무 융통성이 없으면 '꼰대' 소리 듣기 십상이네. 변화를 수용하게."
    },
    "편인": {
      "ko_desc": "남들이 가지 않는 특수한 분야나 자격증으로 승부하네. 기획력과 아이디어는 좋으나, 행동력이 부족해 생각만 하다 끝날 수 있네.",
      "advice": "자네의 머릿속에는 보석이 가득하네. 그것을 현실로 꺼내는 실행력만 갖춘다면 독보적인 존재가 될 걸세."
    },
    "정인": {
      "ko_desc": "학문과 결재권을 쥔 선비와 같네. 윗사람의 혜택을 입어 승진이 빠르고, 문서나 자격증으로 편안하게 먹고사는 운이라네.",
      "advice": "현실 감각이 떨어질 수 있네. 책상물림 소리 안 들으려면 현장 경험을 쌓고 세상 물정을 익혀야 하네."
    }
  },
  "day_pillar": {
    "desc": "중년운 (40~59세). 인생의 허리이자, 배우자와의 관계, 그리고 나 자신의 본질적인 성향을 의미하네.",
    "비견": {
      "ko_desc": "배우자와 친구처럼 지내거나, 혹은 서로 자존심 대결을 하는 형국이네. 내 주장이 강해지니 가정 내 주도권 싸움이 있을 수 있네.",
      "advice": "배우자는 경쟁자가 아니라네. 조금만 져주면 가정이 평화로울 것을, 이겨서 무엇하겠나. 고집을 내려놓게."
    },
    "겁재": {
      "ko_desc": "겉으로는 웃지만 속으로는 배우자를 의심하거나 경쟁하려 드네. 재물 손실이나 배우자의 건강 문제가 우려되는 시기라네.",
      "advice": "가까운 사람일수록 믿음이 필요하네. 의심의 싹을 자르고, 내 것을 나누어준다는 마음으로 배우자를 대하게."
    },
    "식신": {
      "ko_desc": "배우자에게 잘해주고 가정을 화목하게 꾸리려 하네. 의식주가 안정되고, 중년의 여유를 즐길 줄 아는 시기라네.",
      "advice": "내조/외조를 잘하는 것은 좋으나, 상대방이 그것을 당연하게 여기지 않도록 조절이 필요하네. 자네 인생도 챙기게."
    },
    "상관": {
      "ko_desc": "배우자를 내 입맛대로 고치려 잔소리가 늘어나네. 자식에게는 헌신하지만 배우자와는 갈등이 생길 수 있는 위기의 중년이라네.",
      "advice": "말 한마디로 천냥 빚을 갚기도 하고 원수를 만들기도 하네. 배우자에게 나가는 날 선 말을 부드럽게 다듬게."
    },
    "편재": {
      "ko_desc": "사업 확장이나 투기성 재물에 관심이 많아지네. 밖으로 도는 일이 많아 가정에 소홀할 수 있으니 주의가 필요하네.",
      "advice": "돈 쫓다 사람 잃네. 중년의 외도는 패가망신의 지름길이니, 바깥일만큼 집안 단속도 철저히 하게."
    },
    "정재": {
      "ko_desc": "알뜰살뜰 모은 재산으로 안정된 가정을 꾸리네. 배우자에게 월급 통장 맡기고 소소한 행복을 누리는 모범 가장/주부라네.",
      "advice": "너무 인색하게 굴면 배우자가 숨 막혀 하네. 가끔은 지갑을 활짝 열고 기분 좋게 쏘는 멋도 부려보게."
    },
    "편관": {
      "ko_desc": "배우자가 나를 통제하려 들거나, 내가 배우자를 쥐잡듯이 잡는 형국이네. 스트레스가 극에 달해 건강이 상할 수 있네.",
      "advice": "서로 숨 쉴 구멍을 줘야 하네. 서로를 옥죄는 것은 사랑이 아니라 집착이라네. 취미 생활로 스트레스를 풀게."
    },
    "정관": {
      "ko_desc": "가정의 질서와 체면을 중시하네. 책임감이 강해 가장으로서/배우자로서 역할을 다하지만, 재미는 좀 없을 수 있네.",
      "advice": "집은 군대가 아니라네. 각 잡고 살지 말고, 가끔은 흐트러진 모습도 보여주며 인간미를 풍겨보게."
    },
    "편인": {
      "ko_desc": "배우자와의 대화보다는 나만의 세계에 빠지기 쉽네. 중년에 늦깎이 공부를 하거나 종교, 철학에 심취할 수 있네.",
      "advice": "현실 도피는 아니 되네. 배우자가 외로움을 느끼지 않도록, 자네의 그 깊은 생각을 함께 나누려는 노력이 필요하네."
    },
    "정인": {
      "ko_desc": "배우자에게 사랑받고 싶어 하는 아이 같은 면이 있네. 고부갈등이나 장서갈등처럼, 어머니의 입김이 작용할 수 있네.",
      "advice": "이제는 부모 품에서 벗어나 오롯이 부부 중심의 가정을 꾸려야 하네. 효도와 부부 생활을 지혜롭게 구분하게."
    },
    "desc": "중년운 (40~59세). 인생의 허리이자, 배우자와의 관계, 그리고 나 자신의 본질적인 성향을 의미하네."
  },
  "time_pillar": {
    "desc": "말년운 (60세 이후). 자식 농사의 결과, 노후 생활, 그리고 내가 남길 유산을 의미하네.",
    "비견": {
      "ko_desc": "나이 들어서도 내 주장이 강하고 활동적이네. 자식에게 의지하기보다 내 힘으로 살려는 독립적인 노인이네.",
      "advice": "재산을 너무 일찍 물려주지 말게. 내 주머니가 든든해야 자식들도 자주 찾아오는 법이라네."
    },
    "겁재": {
      "ko_desc": "말년에 재물 분쟁이나 자식과의 갈등이 우려되네. 믿었던 사람에게 보증을 서거나 돈을 빌려주는 일은 절대 금물이네.",
      "advice": "욕심을 내려놓고 베푸는 삶을 살아야 존경받네. 움켜쥐려 할수록 손가락 사이로 빠져나가는 것이 말년의 재물이라네."
    },
    "식신": {
      "ko_desc": "의식주가 풍족하고 건강한 장수 만세를 누리네. 자식 덕을 보거나, 소일거리를 하며 평온한 노후를 보내겠구먼.",
      "advice": "잘 먹고 잘 사는 것이 최고의 복이네. 다만 너무 안주하지 말고, 젊은이들에게 지혜를 나누어주는 어른이 되게."
    },
    "상관": {
      "ko_desc": "나이는 들었어도 총기는 여전하네. 자식이나 사회에 대해 쓴소리를 아끼지 않는 깐깐한 어르신 소리 듣겠네.",
      "advice": "입은 닫고 지갑은 열라는 말이 자네에게 딱이네. 잔소리 대신 용돈을 주면 최고의 어른 대접을 받을 걸세."
    },
    "편재": {
      "ko_desc": "말년에도 큰돈을 만지거나 사업을 구상하네. 활동력이 왕성하나 투기나 도박의 유혹에 빠지면 노후가 곤궁해지네.",
      "advice": "건강이 곧 돈이라네. 돈 벌러 다니다 병원비로 다 쓰지 말고, 이제는 여유를 즐기며 건강을 챙기게."
    },
    "정재": {
      "ko_desc": "젊어서 모은 재산으로 안정적인 노후를 보내네. 연금이나 임대 소득으로 따박따박 들어오는 돈이 있어 마음이 편안하네.",
      "advice": "돈 세다 잠들지 말고, 그 돈으로 인생을 즐기게. 여행도 다니고 맛난 것도 사 먹으며 자신을 위해 쓰게나."
    },
    "편관": {
      "ko_desc": "자식 때문에 속을 썩거나, 늦게까지 명예직을 맡아 과로할 수 있네. 자존심 때문에 아픈 내색도 못 할 수 있네.",
      "advice": "자식 인생은 자식 것이네. 짐을 내려놓고 자네의 평안을 찾게. 권력은 내려놓을 때 가장 아름다운 법이라네."
    },
    "정관": {
      "ko_desc": "동네 존경받는 유지나 어른으로 대접받네. 자식들도 반듯하게 잘 커서 효도하니, 명예로운 말년을 보내겠네.",
      "advice": "보수적인 생각만 고집하지 말고, 젊은 세대와 소통하려 노력하게. 그래야 진짜 지혜로운 어른이네."
    },
    "편인": {
      "ko_desc": "종교나 철학에 귀의하거나, 혼자만의 시간을 즐기는 고독한 예술가와 같네. 외로움을 타기 쉬우니 사회 활동이 필요하네.",
      "advice": "고독은 자네의 친구지만, 고립은 병이네. 마음 맞는 벗들과 어울리며 세상과 끈을 놓지 말게."
    },
    "정인": {
      "ko_desc": "문서운이 좋아 임대업이나 저작권 등으로 편안히 사네. 자식이나 주위 사람들의 보살핌을 받으며 안락한 노후를 보내네.",
      "advice": "받는 것에 익숙해져 감사를 잊지 말게. 베풀고 나누면 그 덕이 다시 자네와 자손에게로 돌아갈 걸세."
    }
  }
}
