{
  "conflict_triggers": {
    "wealth_dominance_male": {
      "pattern_name": "재다신약 남성 (Wealth Dominant Male)",
      "desc": "재성(여성/돈)이 너무 많아 일간(나)이 감당하기 힘든 구조. 여자가 많거나, 아내의 기가 센 경우가 많네.",
      "fight_reason": "남성(A)이 배우자(B)나 재물을 통제하려다 오히려 B에게 끌려다니거나, 현실적인 문제에 부딪힐 때 오는 무력감 때문에 다투네. 겉으로는 자존심을 세우려 하지만, 실질적인 주도권은 상대에게 있어 속앓이를 하는 형국이지.",
      "solution": "재물과 아내를 이기려 들지 말고, 아내에게 경제권을 일임하는 것이 편안하네. 본인은 운동이나 취미로 자신감(비겁)을 키워야 가정의 평화가 오네."
    },
    "wealth_dominance_female": {
      "pattern_name": "재다신약 여성 (Wealth Dominant Female)",
      "desc": "재물 욕심은 많으나 내 힘이 약해, 돈을 벌어도 남을 위해 쓰거나 시댁 문제로 고통받기 쉽네.",
      "fight_reason": "돈 문제나 시댁 식구들의 간섭으로 인해 남편과 갈등이 잦네. 내가 희생한다고 생각하니 억울함이 쌓여 폭발할 수 있네.",
      "solution": "시댁과는 적당한 거리를 두고, 맞벌이나 사회 활동을 통해 나의 능력을 증명하며 독립적인 자존감을 찾아야 하네."
    },
    "official_killing_mixed_female": {
      "pattern_name": "관살혼잡 여성 (Mixed Officer Female)",
      "desc": "나를 통제하는 관(남자/직장)이 너무 많아, 남자가 끊이지 않으나 실속 없는 남자 때문에 고생할 수 있네.",
      "fight_reason": "배우자의 의처증이나 간섭 때문에 숨이 막혀 다투거나, 본인이 다른 이성에게 눈을 돌려 갈등을 자초할 수 있네.",
      "solution": "결혼을 늦게 하거나, 물상대체로 남자가 많은 직장(군인, 경찰, 영업 등)에서 일하며 기운을 해소해야 하네."
    },
    "bi_geob_excess_male": {
      "pattern_name": "비겁과다 남성 (Self-Excess Male)",
      "desc": "자기 주장이 너무 강하고 고집이 세어, 아내를 경쟁자로 인식하거나 무시하는 경향이 있네.",
      "fight_reason": "독단적인 결정과 가부장적인 태도 때문에 아내가 상처받고 마음의 문을 닫아버리네. 친구를 너무 좋아해 가정을 소홀히 하여 싸움이 나네.",
      "solution": "아내를 동료나 친구처럼 존중하고, 상의하는 습관을 들여야 하네. 재물(아내)을 지키려면 식상(말과 표현)으로 아내를 부드럽게 대해야 하네."
    }
  },
  "shamanic_advice": {
    "jung_im_harmony_deep_advice": {
      "title": "정임합(丁壬合) 심층 분석: 음란지합의 이면",
      "core_psychology": "촛불(정화)과 호수(임수)가 만나 밤에 몰래 만나는 연인처럼 애틋하고 비밀스러운 합이라네. 감수성이 풍부하고 육체적인 끌림이 강하지만, 그만큼 집착도 강하지.",
      "risk_warning": "서로에게 너무 깊이 빠져들어 소유욕과 질투가 선을 넘을 수 있네. 한쪽이 배신감을 느끼면 집착이 증오로 변해 정신적인 파탄에 이를 수 있는 위험한 사랑이기도 하네. 의처증이나 의부증으로 번질 우려가 크다네.",
      "remedy_action": "이 관계의 핵심은 '투명함'이라네. 서로의 사생활 경계선을 투명하게 공유하고, 비밀을 만들지 않아야 이 뜨거운 불길이 오래 지속될 수 있네. 서로를 구속하려 들기보다는 예술적 감성을 공유하는 취미를 함께 즐기게."
    },
    "mu_gye_harmony_advice": {
      "title": "무계합(戊癸合) 심층 분석: 무정지합의 묘미",
      "core_psychology": "늙은 산(무토)과 어린 비(계수)의 만남이라, 나이 차이나 환경 차이를 뛰어넘는 정이 있네. 겉으로는 무뚝뚝해 보여도 속정은 깊은 관계지.",
      "risk_warning": "너무 다른 환경의 두 사람이 만나 처음에는 호기심에 끌리지만, 시간이 지나면 서로의 차이 때문에 소통이 단절될 수 있네.",
      "remedy_action": "상대방의 다름을 인정하고, 늙은 신랑이 어린 신부를 대하듯 넓은 마음으로 포용해야 하네. 감정적인 표현을 자주 해야 오해가 없네."
    },
    "gap_gi_harmony_advice": {
      "title": "각기합(甲己合) 심층 분석: 중정지합의 안정",
      "core_psychology": "나무가 흙에 뿌리내리듯 가장 안정적이고 이상적인 부부의 모습이라네. 서로의 필요를 채워주는 공생 관계지.",
      "risk_warning": "너무 안정적이다 보니 권태기가 빨리 올 수 있고, 서로를 너무 당연하게 여겨 소홀해질 수 있네.",
      "remedy_action": "가끔은 낯선 곳으로 여행을 떠나거나 새로운 데이트를 통해 신선한 자극을 주어야 하네. 서로에 대한 고마움을 말로 표현하게."
    },
    "general_advice": {
      "title": "신령의 연애 조언",
      "content": "궁합은 점수가 아니라 노력이라네. 서로의 다름을 '틀림'이 아닌 '보완'으로 받아들일 때 비로소 악연도 선연이 되는 법이지. 사주팔자보다 중요한 것은 그대들의 마음가짐이라네."
    }
  }
}
